[
  {
    "id": 48,
    "start": "00:07:31.040",
    "end": "00:07:47.170",
    "original": "Applications are complex, also comes with a lot of challenges. One of them is testing. Testing it on a mainstream website or application is obviously going to get us banned real quick. So, which is why we came up with a dummy website, a testing website here, so I will be showing you",
    "corrected": "Applications are complex, also comes with a lot of challenges. One of them is testing. Testing it on a mainstream website or application is obviously going to get us banned real quick. So, which is why we came up with a dummy website, a testing website here, so I will be showing you",
    "professional": "Applications are complex, also comes with a lot of challenges. One of them is testing. Testing it on a mainstream website or application is going to get us banned real quick., which is why we came up with a dummy website, a testing website here, so i will be showing you.",
    "improvements": []
  },
  {
    "id": 49,
    "start": "00:07:47.450",
    "end": "00:07:52.529",
    "original": "how we have that set up. So, I have an account set up right here.",
    "corrected": "How we have that set up. So, I have an account set up right here.",
    "professional": "How we have that set up., i have an account set up right here.",
    "improvements": []
  },
  {
    "id": 50,
    "start": "00:07:52.920",
    "end": "00:07:55.099",
    "original": "which I'll be logging into.",
    "corrected": "Which I'll be logging into.",
    "professional": "Which i'll be logging into.",
    "improvements": []
  },
  {
    "id": 51,
    "start": "00:08:01.990",
    "end": "00:08:15.949",
    "original": "So as you can see, once I log in, it's a real simple website, which basically shows your username and your email, and some very basic information. Another feature of EtherMail that I'd like to show you",
    "corrected": "So as you can see, once I log in, it's a real simple website, which shows your username and your email, and some very basic information. Another feature of Aether Mail that I'd to show you",
    "professional": "As you can see, once i log in, it is a real simple website, which shows your username and your email, and some basic information. Another feature of aether mail that i'd to demonstrate.",
    "improvements": []
  },
  {
    "id": 52,
    "start": "00:08:16.020",
    "end": "00:08:39.270",
    "original": "is the password generator, which basically lets users generate passwords, securely, and also gives them a choice on how they want to do it. They can either choose a random password, which mixes up letters, characters, and all that, or they could have a memorable one, which is easier to memorize. We also have a slider where you can choose the size of the password you want to set.",
    "corrected": "Is the password generator, which lets users generate passwords, securely, and also gives them a choice on how they want to do it. They can either choose a random password, which mixes up letters, characters, and all that, or they could have a memorable one, which is easier to memorize. We also have a slider where you can choose the size of the password you want to set.",
    "professional": "Is the password generator, which lets users generate passwords, securely, and also gives them a choice on how they want to do it. They can either choose a random password, which mixes up letters, characters, and all that, or they could have a memorable one, which is easier to memorize. We also have a slider where you can choose the size of the password you want to set.",
    "improvements": []
  },
  {
    "id": 53,
    "start": "00:08:39.510",
    "end": "00:08:56.480",
    "original": "And yeah, so this could be used… the password rotation, which we'll be talking next, automatically does it, but we also give the user the choice to manually override it and choose a password of their own, if they wish to do so. I'll be handing it over back to Isaac.",
    "corrected": "And yes, so this could be used… the password rotation, which we will be talking next, automatically does it, but we also give the user the choice to manually override it and choose a password of their own, if they wish to do so. I'll be handing it over back to Isaac.",
    "professional": "Yes, so this could be used. The password rotation, which we will be talking next, automatically does it, but we also give the user the choice to manually override it and choose a password of their own, if they wish to do. I'll be handing it over back to isaac.",
    "improvements": []
  }
]