{
  "speaker": "izaac",
  "role": "Lead Architect & Project Manager",
  "voice_model": "models/izaac_voice_embedding.npy",
  "segments": [
    {
      "id": 1,
      "timestamp": "03:02",
      "context": "Introducing the platform login",
      "text": "Welcome to Aether Mail. This is the first screen users encounter when accessing our platform. Let me walk you through the account creation process."
    },
    {
      "id": 2,
      "timestamp": "03:12",
      "context": "Demonstrating account creation",
      "text": "To create an account, users first review and accept our terms of service. The system then generates secure credentials automatically."
    },
    {
      "id": 3,
      "timestamp": "03:33",
      "context": "Explaining credential security",
      "text": "These generated credentials are cryptographically secure. Users download their private key, which is required for platform access. This ensures complete control over authentication."
    },
    {
      "id": 4,
      "timestamp": "03:43",
      "context": "Login demonstration",
      "text": "Now I'll demonstrate the login process using the credentials we just generated."
    },
    {
      "id": 5,
      "timestamp": "04:10",
      "context": "Dashboard introduction",
      "text": "After authentication, users arrive at the main dashboard. This is the central hub for all email management features."
    },
    {
      "id": 6,
      "timestamp": "04:20",
      "context": "Key features overview",
      "text": "The dashboard provides access to our core features. Most importantly, it handles external email account aggregation."
    },
    {
      "id": 7,
      "timestamp": "04:26",
      "context": "External accounts feature",
      "text": "External account management is the foundation of our platform. Users connect multiple email providers to consolidate everything in one secure location."
    },
    {
      "id": 8,
      "timestamp": "04:34",
      "context": "Provider support",
      "text": "We support all major email providers including Gmail, Outlook, Yahoo, and custom IMAP servers. This allows complete email consolidation regardless of provider."
    },
    {
      "id": 9,
      "timestamp": "04:42",
      "context": "Live demonstration setup",
      "text": "I'll demonstrate by connecting my Gmail account to show the integration process."
    },
    {
      "id": 10,
      "timestamp": "05:21",
      "context": "App password explanation",
      "text": "For security, most providers require application-specific passwords rather than your main account password. We've included direct links to each provider's app password generation page to simplify this process."
    }
  ]
}
